blueskycoco/rtt/bsp/tm4c129x/applications/con_common.c
	MAP_SysCtlDelay(1);
	//config select
	MAP_GPIOIntDisable(GPIO_PORTD_BASE, GPIO_PIN_2);
	MAP_GPIOPinTypeGPIOInput(GPIO_PORTD_BASE, GPIO_PIN_2);//ind0
	MAP_GPIOIntTypeSet(GPIO_PORTD_BASE, GPIO_PIN_2, GPIO_BOTH_EDGES);
	MAP_IntEnable(INT_GPIOD);
	MAP_GPIOIntEnable(GPIO_PORTD_BASE, GPIO_PIN_2);
	int ui32Status = MAP_GPIOIntStatus(GPIO_PORTD_BASE, true);
	MAP_GPIOIntClear(GPIO_PORTD_BASE, ui32Status);
	//connect ind
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTE_BASE, GPIO_PIN_5);//CNN1
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_2);//CNN2
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_3);//CNN3
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_4);//CNN4
	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
	MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
	MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
	default_config();
	memset(config_local_ip,0,11);config_local_ip[11]='\0';
	memset(config_sub_msk,0,11);config_local_ip[11]='\0';
	memset(config_gw,0,11);config_local_ip[11]='\0';
	memset(config_socket3_ip,0,11);config_local_ip[11]='\0';
	memset(config_socket0_ip,0,11);config_local_ip[11]='\0';
	memset(config_socket1_ip,0,11);config_local_ip[11]='\0';
	memset(config_socket2_ip,0,11);config_local_ip[11]='\0';
	memset(config_socket0_local_port,0,9);config_local_ip[11]='\0';
	memset(config_socket1_local_port,0,9);config_local_ip[11]='\0';
	memset(config_socket2_local_port,0,9);config_local_ip[11]='\0';
	memset(config_socket3_local_port,0,9);config_local_ip[11]='\0';
	memset(config_socket0_remote_port,0,9);config_local_ip[11]='\0';
	memset(config_socket1_remote_port,0,9);config_local_ip[11]='\0';
	memset(config_socket2_remote_port,0,9);config_local_ip[11]='\0';
	memset(config_socket3_remote_port,0,9);config_local_ip[11]='\0';
	memset(config_mac,0,13);config_local_ip[11]='\0';
	memset(config_socket0_ip6,0,71);config_local_ip[11]='\0';
	memset(config_socket1_ip6,0,71);config_local_ip[11]='\0';
	memset(config_socket2_ip6,0,71);config_local_ip[11]='\0';
	memset(config_socket3_ip6,0,71);config_local_ip[11]='\0';
	memset(config_local_ip6,0,71);config_local_ip6[71]='\0';
	memset(config_net_protol0,0,8);config_net_protol0[8]='\0';
	memset(config_net_protol1,0,8);config_net_protol1[8]='\0';
	memset(config_net_protol2,0,8);config_net_protol2[8]='\0';
	memset(config_net_protol3,0,8);config_net_protol3[8]='\0';
	memset(config_socket_mode0,0,8);config_socket_mode0[8]='\0';
	memset(config_socket_mode1,0,8);config_socket_mode1[8]='\0';
	memset(config_socket_mode2,0,8);config_socket_mode2[8]='\0';
	memset(config_socket_mode3,0,8);config_socket_mode3[8]='\0';
	memset(config_uart_baud0,0,8);config_uart_baud0[8]='\0';
	memset(config_uart_baud1,0,8);config_uart_baud1[8]='\0';
	memset(config_uart_baud2,0,8);config_uart_baud2[8]='\0';
	memset(config_uart_baud3,0,8);config_uart_baud3[8]='\0';
	memset(config_tcp0,0,8);config_tcp0[8]='\0';
	memset(config_tcp1,0,8);config_tcp1[8]='\0';
	memset(config_tcp2,0,8);config_tcp2[8]='\0';
	memset(config_tcp3,0,8);config_tcp3[8]='\0';
	rt_mutex_init(&mconfigutex, "config_mutex", RT_IPC_FLAG_FIFO);
/*
	for(i=3;i<67;i++)
	{
		config_socket0_ip6[i]=0xff;
		config_socket1_ip6[i]=0xff;
		config_socket2_ip6[i]=0xff;
		config_socket3_ip6[i]=0xff;
		config_local_ip6[i]=0xff;
	}
	config_socket0_ip6[67]=0x26;
	config_socket1_ip6[67]=0x26;
	config_socket2_ip6[67]=0x26;
	config_socket3_ip6[67]=0x26;
	config_local_ip6[67]=0x26;
	config_socket0_ip6[68]=0xfa;
	config_socket1_ip6[68]=0xfa;
	config_socket2_ip6[68]=0xfa;
	config_socket3_ip6[68]=0xfa;
	config_local_ip6[68]=0xfa;
*/
	if(dev==DEV_USB)
		max_devices=5;
	for(i=0;i<max_devices;i++)
	{
		//config sem
		rt_sprintf(common,"common_%d_rx",i);
		rt_sem_init(&(rx_sem[i]), common, 0, 0);
		rt_sprintf(common,"usb_%d_rx",i);
		rt_sem_init(&(usbrx_sem[i]), common, 0, 0);
		if(dev==DEV_UART)
		{
			if(i==1)
				rt_sprintf(common,"uart%d",4);
			else
				rt_sprintf(common,"uart%d",i);
		
			DBG("To open ==>%s\n",common);
			//open uart ,parallel ,usb
			common_dev[i] = rt_device_find(common);
			if (common_dev[i] == RT_NULL)
			{
				DBG("app_common: can not find device: %s\n",common);
				return 0;
			}
			if (rt_device_open(common_dev[i], RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX | RT_DEVICE_FLAG_INT_TX) == RT_EOK)
			{
				//create common_w,r thread to read data from socket write to uart,parallel,usb
				//or read from uart,parallel,usb write to socket
				rt_sprintf(common,"common_wx%d",i);
				tid_common_w[i] = rt_thread_create(common,common_w, (void *)(i*2),4096, 20, 10);
				rt_sprintf(common,"common_rx%d",i);
				tid_common_r[i] = rt_thread_create(common,common_r, (void *)(i*2+1),2048, 20, 10);

				rt_device_set_rx_indicate(common_dev[i], common_rx_ind);

				if(tid_common_w[i]!=RT_NULL)
					rt_thread_startup(tid_common_w[i]);			
				if(tid_common_r[i]!=RT_NULL)
					rt_thread_startup(tid_common_r[i]);
			}
		}
		else if(dev==DEV_BUS)
		{

		}
		else
		{
			//init usbbulk,read data from usb,and transfer data to 4 socket thread by 4 ctl line
			//create 4 common_r thread read data from 4 socket thread,and put data to usb,control 4 ind line
			if(i==0)
			_usb_init();
			rt_kprintf("uub %d\n",i);
			rt_sprintf(common,"common_wx%d",i);
			tid_common_w[i] = rt_thread_create(common,common_w_usb, (void *)(i*2),4096, 20, 10);	
			if(tid_common_w[i]!=RT_NULL)
				rt_thread_startup(tid_common_w[i]);	
			if(i!=4){
			rt_sprintf(common,"common_rx%d",i);
			tid_common_r[i] = rt_thread_create(common,common_r, (void *)(i*2+1),2048, 20, 10);
				
			if(tid_common_r[i]!=RT_NULL)
				rt_thread_startup(tid_common_r[i]);
				}
		}
	}
	//rt_thread_delay(300);	
	for(i=0;i<4;i++)
	{
		g_chang[i].cs=g_chang[i].lip6c=g_chang[i].lpc=g_chang[i].mode=g_chang[i].protol=g_chang[i].rip4c=g_chang[i].rip6c=g_chang[i].rpc=0;
		socket_thread_start(i);
	}
	//rt_thread_delay(100);
	//list_mem1();	
	//list_tcps1();
	//list_thread();
	
	DBG("common_init ok\n");
	//list_mem1();	
	return 1;
}
#endif
